toko-api/app/Controllers/LoginController.php

    public function login()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $model = new MMember();
        $member = $model->where(['email' => $email])->first();

        if (!$member)
        {
            return $this->responseHasil(400, false, "Email tidak ditemukan");
        }

        if (!password_verify($password, $member['password']))
        {
            return $this->responseHasil(400, false, "Password tidak valid");
        }

        $memberTokenModel = new MMemberToken();
        $auth_key = $this->randomString();
        $memberTokenModel->save([
            'member_id' => $member['id'],
            'auth_key' => $auth_key
        ]);
---
SELECT *
FROM `member`
WHERE `email` = 'pentol@gmail.com'
 LIMIT 1
INSERT INTO `member_token` (`member_id`, `auth_key`) VALUES ('20', 'ldiskQ6DGiGnjS5dsiMxhBqgWUMMmWMgM0vZuDKRM1syGVT2cyEwVjTooOIRaxm3qXY8LJmBnoHoHIVtIE76gOk0khygSsWvGM1p')